"""
Натуральное число называется двояким, если в его десятичной записи встречается
не более двух различных цифр. Например, числа 3, 23, 33, 100, 12121 — двоякие,
 а числа 123 и 9980 — нет.
Для заданного натурального числа N требуется найти ближайшее к нему двоякое
число.
"""


# def find_numbers():
#     with open("numbers/INPUT.txt", 'r') as f:
#         number = int(f.readline())

#     with open("numbers/OUTPUT.txt", 'w') as f:
#         f.write("")


# if __name__ == "__main__":
#     find_numbers()
